# Basic Operations

In [1]:
import numpy as np
import pandas as pd

data = {
    'Name': ['Desmond', 'Anna', 'Charlie'], 
    'Age': [25, 30, 35], 
    'Salary': [50000, 60000, 70000]
}

# A DataFrame is like a table with multiple columns.
# Think of it as a full Excel spreadsheet with rows and columns.
df = pd.DataFrame(data)
print("DataFrame: \n",df)

# A Series is a single column of data with labels (index).
# Think of it as a single-column Excel sheet or a list with names.
ser = pd.Series([23,44,55])
print("Series: \n",ser)

DataFrame:
       Name  Age  Salary
0  Desmond   25   50000
1     Anna   30   60000
2  Charlie   35   70000
Series:
 0    23
1    44
2    55
dtype: int64

# Add Update Remove Operations for column and row using dataframe

In [2]:
#writing to csv and making index as false because it will not take index values in csv file
df.to_csv('emp_desc.csv', index=False)

#read data from csv
df = pd.read_csv('emp_desc.csv')

#add new value in df using loc[new_index, 'column_name'] = value and iloc
# df.loc[3, 'Name'] = "Triss"
# df.loc[3, "Age"] = 25
# df.loc[3, "Salary"] = 50000
    
    #or

# df.loc[4] = ["Ethan", 44, 60000]

#adding new column applies to all
df['City'] = 'Mumbai'

#adding new location for age greater than 30
df.loc[df["Age"] > 30, "City"] = "Navi Mumbai"

#updating multiple columns
# df[["Age", "City"]] = [[20, "Thane"], [25, "Airoli"], [33, "Amsterdam"], [55, "NYC"], [59, "Denver"]]

#update single row
# df.loc[1] = ["Yeneffer", 21, 39000, "Mumbai", 0, "NA"]

#using apply function to add new column
df['Age Category'] = df["Age"].apply(lambda x : "Young" if x < 25 else "Adult")

#update specific row column value
df.at[1, 'City'] = "Vashi"

df['Age in 10 years'] = df['Age'] + 10

# remove columns data
# use of inplace If True: the removing is done on the current DataFrame. If False: returns a copy where the removing is done.
# df.drop(columns=['City'], inplace=True)

# remove single row
# df.drop(index=1, inplace=True)

# Keeps only rows where Age > 30
# df = df[df['Age'] > 30]

print('New Dataframe: \n',df)
df.to_csv('emp_desc.csv', index=False)

New Dataframe:
       Name  Age  Salary         City Age Category  Age in 10 years
0  Desmond   25   50000       Mumbai        Adult               35
1     Anna   30   60000        Vashi        Adult               40
2  Charlie   35   70000  Navi Mumbai        Adult               45

# Inbuilt Operations

In [3]:
# First 5 rows default if not specified
df.head(2)

# Last 5 rows default if not specified
df.tail(2)

#returns dimensions of dataframe
df.shape

# returns data types
df.dtypes

# returns column name
df.columns

Index(['Name', 'Age', 'Salary', 'City', 'Age Category', 'Age in 10 years'], dtype='object')

# Statistical Operations

In [4]:
#describe provide mean, median, mode, 25%, 50%, 75% of numerical data
df.describe()

#Count returns non null value
df.count()

# Average age
df['Age'].mean()

# Median age
df['Age'].median()

# Minimum age
df['Age'].min() 

# Maximum age
df['Age'].max()

35

# Sorting and Filtering

In [5]:
#sort values by salary
df.sort_values(by='Salary')

#filter rows by condition
df[df['Age'] > 30]

      Name  Age  Salary         City Age Category  Age in 10 years
2  Charlie   35   70000  Navi Mumbai        Adult               45

# Series Operations

In [6]:
s = pd.Series([10, 20, 30, 40], index=['Triss', 'Yen', 'Charlie', 'Ethan'])

#find by index
# s[0]

#find by label
# s['Yen']

#or

s.iloc[3]

#slicing from 2nd index till last
s[2:]

#slicing from 0 index till 2nd 
s[:2]

#update
s[0] = 100
s['Triss'] = 90

#drop 
# s.drop('Triss', inplace=True)

#mean
s.mean()

#min
s.min()

#max
s.max()

C:\Users\Admin\AppData\Local\Temp\ipykernel_18480\1160529839.py:20: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  s[0] = 100

90

# Handling Missing Data

In [7]:
newdf = pd.DataFrame({'Name': ['Sal', 'Bob', 'Charlie'],
                   'Age': [25, np.nan, 30],
                   'Salary': [50000, 60000, None]})

print("New Data Frame with NA Vals: \n",newdf)

# loc gets rows (and/or columns) with particular labels.
# iloc gets rows (and/or columns) at integer locations.

#drop na records
# df.dropna(inplace=True)
# df.dropna(axis=1, inplace=True)

#Fill NAN values
# newdf.fillna(20, inplace=True)

# Fill with mean age
newdf.fillna(newdf["Age"].mean(), inplace=True)

# Fill with median age
newdf.fillna(newdf["Salary"].median(), inplace=True)

# Forward fill (use previous value)
# newdf.fillna(method="ffill", inplace=True) is deprecated using ffill() method 
# newdf.ffill()

# Backward fill (use next value)
# newdf.fillna(method="bbill", inplace=True) is deprecated using bfill() method 
# newdf.bfill()

print("New Data Frame: \n",newdf)

New Data Frame with NA Vals:
       Name   Age   Salary
0      Sal  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0      NaN
New Data Frame:
       Name   Age   Salary
0      Sal  25.0  50000.0
1      Bob  27.5  60000.0
2  Charlie  30.0     27.5

# Group By Operations

In [15]:
ddf = pd.DataFrame({'Department': ['HR', 'IT', 'Test', 'Finance', 'AI'],
                   'Salary': [50000, 70000, 60000, 80000, 75000]})

#using group by apply aggregate operations
new_ddf = ddf.groupby('Department')['Salary'].mean()
print(new_ddf)

#applying lambda func
ddf_group = ddf.groupby('Department')['Salary'].apply(lambda x: x + 5000)
ddf_group

#applying filters
ddf_group = ddf.groupby('Department').filter(lambda x: x['Salary'].mean() > 60000)
ddf_group

Department
AI         75000.0
Finance    80000.0
HR         50000.0
IT         70000.0
Test       60000.0
Name: Salary, dtype: float64

  Department  Salary
1         IT   70000
3    Finance   80000
4         AI   75000

# Sort And Filter Operations

In [20]:
#sort values by column
df_sorted = ddf.sort_values(by='Salary', ascending=False)
df_sorted

#sort values by multiple column
df_sorted = ddf.sort_values(by=["Department","Salary"], ascending = [True, False])
df_sorted

df_filtered = ddf[ddf['Salary'] > 60000]
df_filtered

  Department  Salary
1         IT   70000
3    Finance   80000
4         AI   75000

# Date Time Operations

In [35]:
#date range changes periods = no of months, freq = frequent ME -> Monthly , W -> Weekly
# print(len(df))
df["Join Date"] = pd.date_range(start='2025-01-01', periods = len(df), freq = "ME")
# df["Join Date"] = pd.date_range(start='2025-01-01', periods = len(df), freq = "W")
df

#conversion to datetime
# df['Join Date'] = pd.to_datetime(df['Join Date'])
# df

#extract values year and month
df['Year'] = df['Join Date'].dt.year
df['Month'] = df['Join Date'].dt.month
df

#add 60 days
df["Join Date"] = df['Join Date'] + pd.DateOffset(days=60)
df

,Name,Age,Salary,City,Age Category,Age in 10 years,Join Date,Year,Month
0,Desmond,25,50000,Mumbai,Adult,35,2025-04-01,2025,1
1,Anna,30,60000,Vashi,Adult,40,2025-04-29,2025,2
2,Charlie,35,70000,Navi Mumbai,Adult,45,2025-05-30,2025,3

# Merge Operations

In [44]:
# merge operations
df1 = pd.DataFrame({'ID': [101, 201, 301], 'Name': ['Alice', 'Bob', 'Charlie']})
#purposely given wrong index id to understand joins func
df2 = pd.DataFrame({'ID': [102, 201, 301], 'Salary': [50000, 60000, 70000]})

#Inner join
df_merged = pd.merge(df1, df2, on = "ID", how = "inner")
df_merged

#left join
df_merged = pd.merge(df1, df2, on = "ID", how = "left")
df_merged

#Right join
df_merged = pd.merge(df1, df2, on = "ID", how = "right")
df_merged

df_merged['Salary'] = df_merged['Salary'] + 5000
df_merged

#drop salary
#df_merged.drop(columns=['Salary'], inplace=True)

    ID     Name  Salary
0  102      NaN   55000
1  201      Bob   65000
2  301  Charlie   75000